"""
============================
Author:柠檬班-木森
Time:2020/6/30   20:09
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""
"""
运算符
算术运算符：
    +: 加法
    -: 减法
    *: 乘
    /: 除
    %: 除法取余数
    //: 除法取商
    **: 幂运算
    
赋值运算符：
    =
    +=
    -=
    /=
    *=
    ....
    
比较运算符
    >:大于
    <：小于
    >=：大于等于
    <=：小于等于
    ==：相等
    !=：不相等


"""
# a = 10
# b = 20
# cc = a - b
# print(cc)

# %: 除法取余数
# print(9 % 5)

# //: 除法取商
# print(9 // 4)

# **: 幂运算
# print(5 ** 2)
# print(5 ** 5)
# print(5 ** 10)

# 赋值运算符

# aa = 10
# aa = aa + 1  # 等同于===>  aa += 1
# aa += 1

# aa = aa - 1  # 等同于===>  aa -= 1
# aa -= 1
# print(aa)


# 比较运算符:得到的结果是一个布尔值：比较的条件成立：返回True  不成立：返回False
# a = 100
# b = 50
# print(a > b)
# print(a < b)
# print(10 > '10') 错误示范 # >  <  >=  <=:比较不同的数据类型会报错


# ==  != 比较的时候，两个数据可以不是同一个类型
# a = 100
# b = "100"
#
# print(a != b)
