"""
============================
Author:柠檬班-木森
Time:2020/7/7   20:11
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""

"""
集合(set类型):

定义:通过{}来表示
    空集合:set()



集合添加元素(了解):
    添加元素:add
    删除元素:remove


集合的特性:
    1、集合中的元素是无序的
    2、集合中只能存在不可变类型的数据
    3、集合中的元素不重复(和数学中的集合一样的)


注意点:字典{}中是键值对的形式,集合和列表元组一样,只有值



"""

# set1= {"11","22","33"}
# print(dic)
# print(type(dic))

# 空字段
# dic = {}

# 定义空集合
# set2 = set()
# print(type(set2))


# set2 = {11, 22}
# add:添加元素
# set2.add(999)
# set2.add(100)

# remove:删除元素
# set2.remove(11)
# print(set2)


# 集合的特性:
# 1、集合中的元素是无序的
# 2、集合中只能存在不可变类型的数据
# 3、集合中的元素不重复(和数学中的集合一样的)


# set2 = {11, 2222, 333, 4444, 11, 11, 22, 33, 11, 22, 33, 33, 'aa', 'bb', '木森'}
# print(set2)

# 需求如何快速去除列表中重复的元素?
# 列表-->集合-->列表
# li = [11, 11, 33, 44, 22, 44, 22, 22, 33, 44, 55, 66]
# res = set(li)
# print(list(res))

# 集合中只能存在不可变类型的数据







