"""
============================
Author:柠檬班-木森
Time:2020/7/14   14:46
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""

print("-----------------------------扩展第一题------------------------")
"""
二、扩展题（选做）温馨提示：难度系数偏高做不出来没关系
1、题目：企业发放的奖金根据利润提成（提示：用到的知识点：条件判断）
    用户输入利润
 	利润低于或等于10万元时，奖金可提10%；
 	利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
 	20万到40万之间时，高于20万元的部分，可提成5%；
	40万到60万之间时，高于40万元的部分，可提成3%；
 	60万到100万之间时，高于60万元的部分，可提成1.5%，高于
	100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数？
"""
# 扩展1
price = float(input("请输入当月利润:"))
if price < 0:
    print("您输入的金额有误！")
elif price <= 100000:
    print(price * 0.1)
elif price <= 200000:
    # 10万元以内的提成
    m1 = 100000 * 0.1
    # 超出10万部分的提成
    m2 = (price - 100000) * 0.075
    print(m1 + m2)
elif price <= 400000:
    # 20万元以内的提成
    m1 = 100000 * 0.1 + 100000 * 0.75
    # 超出20万部分的提成
    m2 = (price - 200000) * 0.05
    print(m1 + m2)
elif price <= 600000:
    # 40万元以内的提成
    m1 = 100000 * 0.1 + 100000 * 0.75 + 200000 * 0.05
    # 超出40万部分的提成
    m2 = (price - 400000) * 0.03
    print(m1 + m2)
elif price <= 1000000:
    # 60万元以内的提成
    m1 = 100000 * 0.1 + 100000 * 0.75 + 200000 * 0.05 + 200000 * 0.03
    # 超出60万部分的提成
    m2 = (price - 600000) * 0.015
    print(m1 + m2)
else:
    # 100万元以内的提成
    m1 = 100000 * 0.1 + 100000 * 0.75 + 200000 * 0.05 + 200000 * 0.03 + 400000 * 0.015
    # 超出60万部分的提成
    m2 = (price - 1000000) * 0.01
    print(m1 + m2)

print("-----------------------------扩展第二题------------------------")
"""
二、编写一个自动售货机，运行功能如下:
1、请按下面提示，选择购买的商品
​    1). 可乐  2.5元
​    2). 雪碧  2.5元
​    3). 哇哈哈   3元
​    4). 红牛  6元
​    5). 脉动   4元
​    6). 果粒橙 3.5元

2、提示用户投币（支持1元，5元，10元）
​	用户输入投币金额，	
​	用户投币金额不够商品价格，继续提示投币，
​	当投币超过商品价格，则返回商品和找零，然后结束程序
"""

print("请按下面提示选择购买的商品:")
print("1). 可乐  2.5元")
print("2). 雪碧  2.5元")
print("3). 哇哈哈   3元")
print("4). 红牛  6元")
print("5). 脉动   4元")
print("6). 果粒橙 3.5元")
num = input("请输入您的选项:")
if num == "1":
    print("您购买的是可乐，需要支付金额为2.5元")
    price = 2.5
elif num == "2":
    print("您购买的是雪碧，需要支付金额为2.5元")
    price = 2.5
elif num == "3":
    print("您购买的是哇哈哈，需要支付金额为3元")
    price = 3
elif num == "4":
    print("您购买的是红牛，需要支付金额为6元")
    price = 6
elif num == "5":
    print("您购买的是脉动，需要支付金额为4元")
    price = 4
elif num == "6":
    print("您购买的是果粒橙，需要支付金额为3.5元")
    price = 3.5
else:
    print("您的输入有误！")
    price = 0

# 用户投币
money = 0
while money < price:
    m = input("请输入投币金额【支持1元，5元，10元】:")
    if m in ['1', '5', '10']:
        money += int(m)
    else:
        print("您投币的金额有误或者不支持该面额")
else:
    print("您的投币金额为{}元,商品的价格为{}元,找零{}元".format(money, price, money - price))

print("-----------------------------扩展第三题------------------------")
"""
三、打印99乘法口诀表
"""
for i in range(1, 10):
    for j in range(1, i + 1):
        print("{}*{}={:<4}".format(j, i, i * j), end="")
    print()

print("-----------------------------扩展第四题------------------------")
"""
四、小明有100块钱 ，需要买100本书（钱要刚好花完），a类数5元一本，b类书3元一本，c类书 1元2本。请写一段代码计算小明有多少种购买的方式？
   思路提示：穷举法，使用技术点：for循环嵌套
"""
count = 0
for a in range(100 // 5 + 1):
    for b in range(100 // 3 + 1):
        if a * 5 + b * 3 + (100 - a - b) * 0.5 == 100:
            count += 1
print('一共有{}种买法'.format(count))
