"""
============================
Author:柠檬班-木森
Time:2020/7/4   10:49
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""
"""
字典(dict类型):使用{}来表示

字典的定义:
    空字典:{}

注意点:字典中的元素是有key:value组成的
      key:同一个字典中的key是唯一的(不能存在重复的key) 
          字典中的key只能是不可变类型的数据(数值,字符串,元组),通过都是使用字符串   

      value:字典中的value可以保存任何类型的数据






"""
# 空字典
# dic = {}
# print(type(dic), dic)

# dic = {"name": '木森', 'age': 18, 'name1': '向日葵'}
# print(dic)


# 字典的定义方式
# 方式一:掌握
# dic = {"name": '木森', 'age': 18, 'name1': '向日葵'}


# 方式二:掌握
# dic = dict(
#     name="木森",
#     age=18,
#     name1="向日葵"
# )
# print(dic)


# 方式三:了解即可
# dic = dict(
#     [('name', '木森'), ('age', 18),('name1','向日葵')]
# )
# print(dic)
