"""
============================
Author:柠檬班-木森
Time:2020/7/7   22:12
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""
print("-------------------------第1题---------------------------")
"""
1、有下面几个数据 ，t1 = ("aa",11)      t2= ("bb",22)    li1 = [("cc",22)]
请通过学过的知识点，进行相关操作变为如下字典: {"aa":11,"cc":22,"bb":22}
"""
t1 = ("aa", 11)
t2 = ("bb", 22)
li1 = [("cc", 22)]
li1.insert(0, t1)
li1.append(t2)
print(dict(li1))

print("-------------------------第2题---------------------------")
"""
2、当前有一个列表 li = [11,22,33,22,22,44,55,77,88,99,11]，
 要求一：去除列表中的重复元素，
 要求二：去重后删除 77，88，99这三个元素
"""
li = [11, 22, 33, 22, 22, 44, 55, 77, 88, 99, 11]
li = list(set(li))
print(li)
# 删除77 88 99
li.remove(77)
li.remove(88)
li.remove(99)
print(li)

print("-------------------------第3题---------------------------")
"""
3、利用random函数生成随机整数（范围1-9），然后用户输入一个数字，来进行比较：
如果大于随机数，则打印印大于随机数。
如果小于随机数，则打印小于随机数。
如果相等随机数，则打印等于随机数。
"""
import random

n = random.randint(1, 9)
my_num = float(input('请输入数字:'))
if n < my_num:
    print('大于随机数')
elif n == my_num:
    print('等于随机数')
else:
    print('小于随机数')

print("-------------------------第4题---------------------------")
"""
4、一家商场在降价促销。如果购买金额50-100元(包含50元和100元)之间，会给打九折， 
如果购买金额大于100元会给打八折。编写一程序，询问购买价格，再打印出折扣和最终价格。
"""
money = float(input('请输入购买金额:'))
if money <= 0:
    print("输入有误")
elif 0 < money < 50:
    print('没有折扣，您需要支付{}元'.format(money))
elif 50 <= money <= 100:
    print('折扣为9折，您需要支付{}元'.format(money * 0.9))
else:
    print('折扣为8折，您需要支付{}元'.format(money * 0.8))

print("-------------------------第5题---------------------------")
"""
5、提示用户输入一个数（只考虑整数），判断这个数能同时被3和5整除，
能整除打印 :能整除 
不能整除打印：不能整除
"""
num = int(input("请输入数字"))
if num % 3 == 0 and num % 5 == 0:
    print("能整除")
else:
    print("不能整除")
