"""
============================
Author:柠檬班-木森
Time:2020/7/2   20:14
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""

num = 3.442312
# 1、 字符串格式化小数长度(会四舍五入)
# format
print("这个数值是{:.2f}".format(num))
# f表达式
print(f"这个数值是{num:.2f}")

# 2、格式字符串的长度
name = "木森11"
name2 = "木森111"
name3 = "木森1111"
name4 = "木森11111"

print("我的名字叫{:>10},今年18岁".format(name))
print("我的名字叫{:>10},今年18岁".format(name2))
print("我的名字叫{:>10},今年18岁".format(name3))
print("我的名字叫{:>10},今年18岁".format(name4))

# print(f"我的名字叫{name:>10},今年18岁")
# print(f"我的名字叫{name2:>10},今年18岁")
# print(f"我的名字叫{name3:>10},今年18岁")
# print(f"我的名字叫{name4:>10},今年18岁")

# 3、格式化百分比
a = 0.44
print('百分百显示的数据为：{:.2%}'.format(a))
print(f'百分百显示的数据为：{a:.2%}')
