"""
============================
Author:柠檬班-木森
Time:2020/7/2   21:02
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""
"""
列表(list类型)：在python是用中括号表示（和其他语言中的数组看起来差不多）
[11,22,33,'python']

列表中可以存储任意类型的数据


列表和字符串（后续会讲的元祖，有一个公用的操作）：切片和索引取值
索引取值：通过下标的值，获取指定位置的数据
正向索引：从前往后数，从0开始
反向所有：从后往前，从-1开始（全是负数）

切片：
[a:b]:切片操作是左闭右开  ==>数学中范围表示的[a,b)

[a:b:c]：
[起始位置：终止位置：步长]

"""
# 1、列表中可以存储任意类型的数据
# li = [11, 1.3, True, '788', [11, 22]]

# 空字符串
# s1 = ""
# # 空列表
# li = []
# print(type(s1), type(li))

# s = '12345678'
# li = [11, 22, 33, 44, 55, 66, 77, 88]

# 索引(下标)取值
# res = s[1]
# print(res)
# res2 = li[4]
# print(res2)

# 反向索引取值
# print(li[-4])
# print(s[-3])


# -----------------切片------------------------
# li1 = ['python', 'java', 'c', 'c++', 'php']
# # qie
# print(li1[1:3])

# 切片获取33,44,55,66
# li = [11, 22, 33, 44, 55, 66, 77, 88]
# print(li[2:6])

# 切片获取666
# s4 = "musen 666 python"
# print(s4[6:9])


# 切片的步长
# s = '123456789'
# 34 56 78
# 357
# 345 678
# 36
# 3456 78
# 37
# res = s[2:8:2]
# print(res)

# 扩展 ：反向步长切片
# 反向步长，是从后往前进行切片，
# 起始位置和终止位置：起始位置>终止位置
# s = '123456789'
# print(s[8:3:-3])

